In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [5]:
Data=["Sultan","Ali","Abdullah"]
Data=pd.Series(Data, index=[1,2,3])
Data

1      Sultan
2         Ali
3    Abdullah
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [8]:
Data.index=[11,12,13]
Data

11      Sultan
12         Ali
13    Abdullah
dtype: object

## Q3: Retrieve First and second elements.

In [11]:
Data[:2]

11    Sultan
12       Ali
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [15]:
new_data = pd.Series(["Sultan","Ali","Abdullah"])
Data = Data.append(new_data)
Data

C:\Users\ttsul\AppData\Local\Temp\ipykernel_13552\2682826882.py:2: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  Data = Data.append(new_data)

11      Sultan
12         Ali
13    Abdullah
0       Sultan
1          Ali
2     Abdullah
dtype: object

In [20]:
Data.drop_duplicates(inplace=True)
Data

11      Sultan
12         Ali
13    Abdullah
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [25]:
Student={"ID":[111,222,333],
        "Name":["Sultan","Ali","Abdullah"],
        "GPA":[4.5,4.9,3.86]}

pd.DataFrame(Student,columns=["ID","Name","GPA"])

    ID      Name   GPA
0  111    Sultan  4.50
1  222       Ali  4.90
2  333  Abdullah  3.86

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [31]:
edu=pd.read_csv("C:/Users/ttsul/OneDrive/سطح المكتب/BootCamp Materials/Lectures/6-pandas/educ_figdp_1_Data.csv")
edu.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [40]:
edu[:3] ## slicing last item(execluded) because slice use the position as references.

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e

In [41]:
edu.loc[:3] # loc Include Last Because loc use the index labels as references

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e